*** 변수 할당

변수 할당은 ~=~ 기호를 사용합니다.

#+BEGIN_SRC python :exports both :results output
a = 10
a = a + 30
print(a)
#+END_SRC

#+RESULTS:
: 50


*** 웹에서 데이터 가져오기

웹에서 데이터를 가져오는 방법을 간단히 소개했습니다. ~requests~ 라는 모듈을 불러들여 사용했지요.

#+BEGIN_SRC python :exports both :results output
import requests
url = 'https://raw.githubusercontent.com/toracle/python-basic-lecture/master/assets/day1-example-read.txt'
response = requests.get(url)
print(response.text)
#+END_SRC

#+RESULTS:
: ID,Sex,Age,Programming?,Python?
: 1,M,25,T,T
: 2,F,27,T,F
: 3,F,24,F,F
: 4,F,25,T,T
: 5,M,32,F,F
: 6,M,39,T,F
: 


** 종합 활용

for문, if문, dict문 등을 종합적으로 활용해보도록 하겠습니다.

이번에는, 국토교통부에서 배포하는 주택 실거래가 데이터를 가져와서 사용하겠습니다.

먼저 [[https://github.com/toracle/python-basic-lecture/blob/master/assets/%25EC%2595%2584%25ED%258C%258C%25ED%258A%25B8(%25EB%25A7%25A4%25EB%25A7%25A4)__%25EC%258B%25A4%25EA%25B1%25B0%25EB%259E%2598%25EA%25B0%2580_20180704110406.csv][데이터]]를 한번 살펴볼까요?

파일 상단에 여러 안내 문구가 들어있고, 좀더 아래로 내려가면 실제 데이터가 등장합니다.

#+BEGIN_EXAMPLE
"시군구","번지","본번","부번","단지명","전용면적(㎡)","계약년월","계약일","거래금액(만원)","층","건축년도","도로명"
"서울특별시 송파구 가락동","166-2","0166","0002","sk파크타워","84.35","201801","11~20","63,000","13","2003","오금로"
"서울특별시 송파구 가락동","166-2","0166","0002","sk파크타워","84.85","201801","21~31","64,000","5","2003","오금로"
"서울특별시 송파구 가락동","166-2","0166","0002","sk파크타워","84.35","201803","21~31","69,500","17","2003","오금로"
#+END_EXAMPLE

이 데이터를 가지고, 면적별, 계약연월별, 단지별 등으로 평균 가격을 살펴보고, 그래프로 그려보는 작업을 해보겠습니다.

우선, 이 데이터를 아래와 같이 불러오겠습니다.

#+BEGIN_SRC python :exports both :results output
  import requests
  url = 'https://raw.githubusercontent.com/toracle/python-basic-lecture/master/assets/아파트(매매)__실거래가_20180704110406.csv'
  response = requests.get(url, stream=True)

  for line in response.iter_lines():
      print(line.decode('euckr'))
#+END_SRC

#+RESULTS:
#+begin_example
"□ 본 서비스에서 제공하는 정보는 법적인 효력이 없으므로 참고용으로만 활용하시기 바라며, 외부 공개시에는 반드시 신고일 기준으로 집계되면 공식통계를 이용하여 주시기 바랍니다."
"□ 신고정보가 실시간 변경, 해제되어 제공시점에 따라 공개건수 및 내용이 상이할 수 있는 점 참고하시기 바랍니다."
"□ 본 자료는 계약일 기준입니다. (※ 7월 계약, 8월 신고건 → 7월 거래건으로  제공)"
"□ 통계자료 활용시에는 수치가 왜곡될 수 있으니 참고자료로만 활용하시기  바라며,  외부 공개시에는 반드시 신고일 기준으로 집계되는 공식통계를 이용하여 주시기 바랍니다."
"* 주택매매 거래는 부동산 거래신고 등에 관한 법률 제3조에 따라 계약일로부터 60일 이내 신고토록 하고 있습니다."
"* 국토교통부 실거래가 공개시스템의 궁금하신 점이나 문의사항은 콜센터 1588-0149로 연락 주시기 바랍니다."
"□ 검색조건"
"계약일자 : 20180101 ~ 20180630"
"실거래구분 : 아파트(매매)"
"주소구분 : 지번주소"
#+end_example


~open~ 함수를 통해 파일을 불러들일 때는 단지 ~for line fin:~ 명령만으로 한 줄씩 순회할 수 있었는데, ~requests~ 에서 내용을 한줄씩 순회하려면, ~iter_lines()~ 메소드를 사용해야 합니다.

그리고, 그렇게 읽어들인 각 line은 인코딩이 지정되어 있지 않아서 한글이 깨지는 상태이기 때문에, ~euc-kr~ 인코딩으로 한글을 올바로 읽어들입니다.


파일 상단에는 불필요한 내용들이 들어가 있습니다. 이런 내용들은 분석에 사용하지 않으려 합니다. 17행 미만은 처리하지 않습니다.

#+BEGIN_SRC python :exports both :results output
  import requests
  url = 'https://raw.githubusercontent.com/toracle/python-basic-lecture/master/assets/아파트(매매)__실거래가_20180704110406.csv'
  response = requests.get(url, stream=True)

  num_lines = 0

  for line in response.iter_lines():
      num_lines = num_lines + 1

      if num_lines < 17:
          continue

      print(line.decode('euckr'))
#+END_SRC

#+RESULTS:
#+begin_example
"서울특별시 송파구 가락동","166-2","0166","0002","sk파크타워","84.35","201801","11~20","63,000","13","2003","오금로"
"서울특별시 송파구 가락동","166-2","0166","0002","sk파크타워","84.85","201801","21~31","64,000","5","2003","오금로"
"서울특별시 송파구 가락동","166-2","0166","0002","sk파크타워","84.35","201803","21~31","69,500","17","2003","오금로"
"서울특별시 송파구 가락동","166-2","0166","0002","sk파크타워","84.88","201804","1~10","64,900","3","2003","오금로"
"서울특별시 송파구 가락동","140","0140","0000","가락(1차)쌍용아파트","59.92","201801","1~10","60,800","24","1997","동남로"
"서울특별시 송파구 가락동","140","0140","0000","가락(1차)쌍용아파트","59.92","201801","1~10","62,700","4","1997","동남로"
#+end_example


이제 이 중에서, 가장 처음 등장하는 ~sk파크타워~ 아파트의 가격을 한번 수집해볼까요?

#+BEGIN_SRC python :exports both :results output
  import requests
  url = 'https://raw.githubusercontent.com/toracle/python-basic-lecture/master/assets/아파트(매매)__실거래가_20180704110406.csv'
  response = requests.get(url, stream=True)

  num_lines = 0

  price_list = []

  for line in response.iter_lines():
      num_lines = num_lines + 1

      if num_lines < 17:
          continue

      cols = line.decode('euckr').split(',', 8)
      apt_name = cols[4].replace('"', '')
      area = cols[5].replace('"', '')
      yearmonth = cols[6].replace('"', '')
      price = cols[8].replace('"', '')

      print(apt_name, area, yearmonth, price)
#+END_SRC

#+RESULTS:
#+begin_example
sk파크타워 84.35 201801 63,000,13,2003,오금로
sk파크타워 84.85 201801 64,000,5,2003,오금로
sk파크타워 84.35 201803 69,500,17,2003,오금로
sk파크타워 84.88 201804 64,900,3,2003,오금로
#+end_example

